###################################################################

# Created by write_sdc on Tue Jul 9 09:11:07 2024

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_operating_conditions -analysis_type bc_wc -max worst -max_library smic18_ss -min best -min_library smic18_ff
set_wire_load_mode segmented
set_wire_load_model -name reference_area_10000000 -library smic18_ss
set_max_transition 1 [current_design]
set_max_capacitance 0.208867 [current_design]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HADDR[31]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HADDR[30]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HADDR[29]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HADDR[28]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HADDR[27]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HADDR[26]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HADDR[25]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HADDR[24]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HADDR[23]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HADDR[22]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HADDR[21]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HADDR[20]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HADDR[19]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HADDR[18]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HADDR[17]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HADDR[16]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HADDR[15]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HADDR[14]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HADDR[13]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HADDR[12]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HADDR[11]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HADDR[10]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HADDR[9]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HADDR[8]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HADDR[7]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HADDR[6]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HADDR[5]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HADDR[4]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HADDR[3]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HADDR[2]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HADDR[1]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HADDR[0]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HWDATA[31]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HWDATA[30]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HWDATA[29]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HWDATA[28]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HWDATA[27]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HWDATA[26]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HWDATA[25]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HWDATA[24]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HWDATA[23]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HWDATA[22]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HWDATA[21]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HWDATA[20]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HWDATA[19]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HWDATA[18]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HWDATA[17]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HWDATA[16]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HWDATA[15]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HWDATA[14]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HWDATA[13]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HWDATA[12]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HWDATA[11]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HWDATA[10]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HWDATA[9]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HWDATA[8]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HWDATA[7]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HWDATA[6]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HWDATA[5]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HWDATA[4]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HWDATA[3]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HWDATA[2]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HWDATA[1]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HWDATA[0]}]
set_driving_cell -lib_cell INVHD2X [get_ports pad_HWRITE]
set_driving_cell -lib_cell INVHD2X [get_ports pad_HSELx]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HSIZE[1]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HSIZE[0]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HTRANS[1]}]
set_driving_cell -lib_cell INVHD2X [get_ports {pad_HTRANS[0]}]
set_driving_cell -lib_cell INVHD2X [get_ports pad_i_pad_pmodb_miso]
set_load -pin_load 0.0522168 [get_ports {pad_HRDATA[31]}]
set_load -pin_load 0.0522168 [get_ports {pad_HRDATA[30]}]
set_load -pin_load 0.0522168 [get_ports {pad_HRDATA[29]}]
set_load -pin_load 0.0522168 [get_ports {pad_HRDATA[28]}]
set_load -pin_load 0.0522168 [get_ports {pad_HRDATA[27]}]
set_load -pin_load 0.0522168 [get_ports {pad_HRDATA[26]}]
set_load -pin_load 0.0522168 [get_ports {pad_HRDATA[25]}]
set_load -pin_load 0.0522168 [get_ports {pad_HRDATA[24]}]
set_load -pin_load 0.0522168 [get_ports {pad_HRDATA[23]}]
set_load -pin_load 0.0522168 [get_ports {pad_HRDATA[22]}]
set_load -pin_load 0.0522168 [get_ports {pad_HRDATA[21]}]
set_load -pin_load 0.0522168 [get_ports {pad_HRDATA[20]}]
set_load -pin_load 0.0522168 [get_ports {pad_HRDATA[19]}]
set_load -pin_load 0.0522168 [get_ports {pad_HRDATA[18]}]
set_load -pin_load 0.0522168 [get_ports {pad_HRDATA[17]}]
set_load -pin_load 0.0522168 [get_ports {pad_HRDATA[16]}]
set_load -pin_load 0.0522168 [get_ports {pad_HRDATA[15]}]
set_load -pin_load 0.0522168 [get_ports {pad_HRDATA[14]}]
set_load -pin_load 0.0522168 [get_ports {pad_HRDATA[13]}]
set_load -pin_load 0.0522168 [get_ports {pad_HRDATA[12]}]
set_load -pin_load 0.0522168 [get_ports {pad_HRDATA[11]}]
set_load -pin_load 0.0522168 [get_ports {pad_HRDATA[10]}]
set_load -pin_load 0.0522168 [get_ports {pad_HRDATA[9]}]
set_load -pin_load 0.0522168 [get_ports {pad_HRDATA[8]}]
set_load -pin_load 0.0522168 [get_ports {pad_HRDATA[7]}]
set_load -pin_load 0.0522168 [get_ports {pad_HRDATA[6]}]
set_load -pin_load 0.0522168 [get_ports {pad_HRDATA[5]}]
set_load -pin_load 0.0522168 [get_ports {pad_HRDATA[4]}]
set_load -pin_load 0.0522168 [get_ports {pad_HRDATA[3]}]
set_load -pin_load 0.0522168 [get_ports {pad_HRDATA[2]}]
set_load -pin_load 0.0522168 [get_ports {pad_HRDATA[1]}]
set_load -pin_load 0.0522168 [get_ports {pad_HRDATA[0]}]
set_load -pin_load 0.0522168 [get_ports pad_o_pad_pmodb_mosi]
set_load -pin_load 0.0522168 [get_ports pad_o_pad_pmodb_cs]
set_load -pin_load 0.0522168 [get_ports pad_o_pad_pmodb_spi_clk]
set_load -pin_load 0.0522168 [get_ports pad_HREADY]
set_load -pin_load 0.0522168 [get_ports {pad_HRESP[1]}]
set_load -pin_load 0.0522168 [get_ports {pad_HRESP[0]}]
set_max_fanout 10 [get_ports pad_HCLK]
set_max_fanout 10 [get_ports pad_HRST_n]
set_max_fanout 10 [get_ports {pad_HADDR[31]}]
set_max_fanout 10 [get_ports {pad_HADDR[30]}]
set_max_fanout 10 [get_ports {pad_HADDR[29]}]
set_max_fanout 10 [get_ports {pad_HADDR[28]}]
set_max_fanout 10 [get_ports {pad_HADDR[27]}]
set_max_fanout 10 [get_ports {pad_HADDR[26]}]
set_max_fanout 10 [get_ports {pad_HADDR[25]}]
set_max_fanout 10 [get_ports {pad_HADDR[24]}]
set_max_fanout 10 [get_ports {pad_HADDR[23]}]
set_max_fanout 10 [get_ports {pad_HADDR[22]}]
set_max_fanout 10 [get_ports {pad_HADDR[21]}]
set_max_fanout 10 [get_ports {pad_HADDR[20]}]
set_max_fanout 10 [get_ports {pad_HADDR[19]}]
set_max_fanout 10 [get_ports {pad_HADDR[18]}]
set_max_fanout 10 [get_ports {pad_HADDR[17]}]
set_max_fanout 10 [get_ports {pad_HADDR[16]}]
set_max_fanout 10 [get_ports {pad_HADDR[15]}]
set_max_fanout 10 [get_ports {pad_HADDR[14]}]
set_max_fanout 10 [get_ports {pad_HADDR[13]}]
set_max_fanout 10 [get_ports {pad_HADDR[12]}]
set_max_fanout 10 [get_ports {pad_HADDR[11]}]
set_max_fanout 10 [get_ports {pad_HADDR[10]}]
set_max_fanout 10 [get_ports {pad_HADDR[9]}]
set_max_fanout 10 [get_ports {pad_HADDR[8]}]
set_max_fanout 10 [get_ports {pad_HADDR[7]}]
set_max_fanout 10 [get_ports {pad_HADDR[6]}]
set_max_fanout 10 [get_ports {pad_HADDR[5]}]
set_max_fanout 10 [get_ports {pad_HADDR[4]}]
set_max_fanout 10 [get_ports {pad_HADDR[3]}]
set_max_fanout 10 [get_ports {pad_HADDR[2]}]
set_max_fanout 10 [get_ports {pad_HADDR[1]}]
set_max_fanout 10 [get_ports {pad_HADDR[0]}]
set_max_fanout 10 [get_ports {pad_HWDATA[31]}]
set_max_fanout 10 [get_ports {pad_HWDATA[30]}]
set_max_fanout 10 [get_ports {pad_HWDATA[29]}]
set_max_fanout 10 [get_ports {pad_HWDATA[28]}]
set_max_fanout 10 [get_ports {pad_HWDATA[27]}]
set_max_fanout 10 [get_ports {pad_HWDATA[26]}]
set_max_fanout 10 [get_ports {pad_HWDATA[25]}]
set_max_fanout 10 [get_ports {pad_HWDATA[24]}]
set_max_fanout 10 [get_ports {pad_HWDATA[23]}]
set_max_fanout 10 [get_ports {pad_HWDATA[22]}]
set_max_fanout 10 [get_ports {pad_HWDATA[21]}]
set_max_fanout 10 [get_ports {pad_HWDATA[20]}]
set_max_fanout 10 [get_ports {pad_HWDATA[19]}]
set_max_fanout 10 [get_ports {pad_HWDATA[18]}]
set_max_fanout 10 [get_ports {pad_HWDATA[17]}]
set_max_fanout 10 [get_ports {pad_HWDATA[16]}]
set_max_fanout 10 [get_ports {pad_HWDATA[15]}]
set_max_fanout 10 [get_ports {pad_HWDATA[14]}]
set_max_fanout 10 [get_ports {pad_HWDATA[13]}]
set_max_fanout 10 [get_ports {pad_HWDATA[12]}]
set_max_fanout 10 [get_ports {pad_HWDATA[11]}]
set_max_fanout 10 [get_ports {pad_HWDATA[10]}]
set_max_fanout 10 [get_ports {pad_HWDATA[9]}]
set_max_fanout 10 [get_ports {pad_HWDATA[8]}]
set_max_fanout 10 [get_ports {pad_HWDATA[7]}]
set_max_fanout 10 [get_ports {pad_HWDATA[6]}]
set_max_fanout 10 [get_ports {pad_HWDATA[5]}]
set_max_fanout 10 [get_ports {pad_HWDATA[4]}]
set_max_fanout 10 [get_ports {pad_HWDATA[3]}]
set_max_fanout 10 [get_ports {pad_HWDATA[2]}]
set_max_fanout 10 [get_ports {pad_HWDATA[1]}]
set_max_fanout 10 [get_ports {pad_HWDATA[0]}]
set_max_fanout 10 [get_ports pad_HWRITE]
set_max_fanout 10 [get_ports pad_HSELx]
set_max_fanout 10 [get_ports {pad_HSIZE[1]}]
set_max_fanout 10 [get_ports {pad_HSIZE[0]}]
set_max_fanout 10 [get_ports {pad_HTRANS[1]}]
set_max_fanout 10 [get_ports {pad_HTRANS[0]}]
set_max_fanout 10 [get_ports pad_i_pad_pmodb_miso]
set_ideal_network [get_ports pad_HRST_n]
create_clock [get_ports pad_HCLK]  -name PAD_clk  -period 8  -waveform {0 4}
set_clock_latency 0.8  [get_clocks PAD_clk]
set_clock_uncertainty 0.1  [get_clocks PAD_clk]
set_clock_transition -max -rise 0.3 [get_clocks PAD_clk]
set_clock_transition -max -fall 0.3 [get_clocks PAD_clk]
set_clock_transition -min -rise 0.3 [get_clocks PAD_clk]
set_clock_transition -min -fall 0.3 [get_clocks PAD_clk]
set_false_path   -from [get_ports pad_HRST_n]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HADDR[31]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HADDR[31]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HADDR[30]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HADDR[30]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HADDR[29]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HADDR[29]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HADDR[28]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HADDR[28]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HADDR[27]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HADDR[27]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HADDR[26]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HADDR[26]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HADDR[25]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HADDR[25]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HADDR[24]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HADDR[24]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HADDR[23]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HADDR[23]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HADDR[22]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HADDR[22]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HADDR[21]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HADDR[21]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HADDR[20]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HADDR[20]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HADDR[19]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HADDR[19]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HADDR[18]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HADDR[18]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HADDR[17]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HADDR[17]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HADDR[16]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HADDR[16]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HADDR[15]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HADDR[15]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HADDR[14]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HADDR[14]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HADDR[13]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HADDR[13]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HADDR[12]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HADDR[12]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HADDR[11]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HADDR[11]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HADDR[10]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HADDR[10]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HADDR[9]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HADDR[9]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HADDR[8]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HADDR[8]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HADDR[7]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HADDR[7]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HADDR[6]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HADDR[6]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HADDR[5]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HADDR[5]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HADDR[4]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HADDR[4]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HADDR[3]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HADDR[3]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HADDR[2]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HADDR[2]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HADDR[1]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HADDR[1]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HADDR[0]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HADDR[0]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HWDATA[31]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HWDATA[31]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HWDATA[30]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HWDATA[30]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HWDATA[29]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HWDATA[29]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HWDATA[28]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HWDATA[28]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HWDATA[27]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HWDATA[27]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HWDATA[26]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HWDATA[26]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HWDATA[25]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HWDATA[25]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HWDATA[24]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HWDATA[24]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HWDATA[23]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HWDATA[23]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HWDATA[22]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HWDATA[22]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HWDATA[21]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HWDATA[21]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HWDATA[20]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HWDATA[20]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HWDATA[19]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HWDATA[19]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HWDATA[18]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HWDATA[18]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HWDATA[17]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HWDATA[17]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HWDATA[16]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HWDATA[16]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HWDATA[15]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HWDATA[15]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HWDATA[14]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HWDATA[14]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HWDATA[13]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HWDATA[13]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HWDATA[12]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HWDATA[12]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HWDATA[11]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HWDATA[11]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HWDATA[10]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HWDATA[10]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HWDATA[9]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HWDATA[9]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HWDATA[8]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HWDATA[8]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HWDATA[7]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HWDATA[7]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HWDATA[6]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HWDATA[6]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HWDATA[5]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HWDATA[5]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HWDATA[4]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HWDATA[4]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HWDATA[3]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HWDATA[3]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HWDATA[2]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HWDATA[2]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HWDATA[1]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HWDATA[1]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HWDATA[0]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HWDATA[0]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports pad_HWRITE]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports pad_HWRITE]
set_input_delay -clock PAD_clk  -max 4  [get_ports pad_HSELx]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports pad_HSELx]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HSIZE[1]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HSIZE[1]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HSIZE[0]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HSIZE[0]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HTRANS[1]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HTRANS[1]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports {pad_HTRANS[0]}]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports {pad_HTRANS[0]}]
set_input_delay -clock PAD_clk  -max 4  [get_ports pad_i_pad_pmodb_miso]
set_input_delay -clock PAD_clk  -min 0.1  [get_ports pad_i_pad_pmodb_miso]
set_output_delay -clock PAD_clk  -max 4  [get_ports pad_o_pad_pmodb_mosi]
set_output_delay -clock PAD_clk  -min -1  [get_ports pad_o_pad_pmodb_mosi]
set_output_delay -clock PAD_clk  -max 4  [get_ports pad_o_pad_pmodb_cs]
set_output_delay -clock PAD_clk  -min -1  [get_ports pad_o_pad_pmodb_cs]
set_output_delay -clock PAD_clk  -max 4  [get_ports pad_o_pad_pmodb_spi_clk]
set_output_delay -clock PAD_clk  -min -1  [get_ports pad_o_pad_pmodb_spi_clk]
set_output_delay -clock PAD_clk  -max 4  [get_ports pad_HREADY]
set_output_delay -clock PAD_clk  -min -1  [get_ports pad_HREADY]
set_output_delay -clock PAD_clk  -max 4  [get_ports {pad_HRESP[1]}]
set_output_delay -clock PAD_clk  -min -1  [get_ports {pad_HRESP[1]}]
set_output_delay -clock PAD_clk  -max 4  [get_ports {pad_HRESP[0]}]
set_output_delay -clock PAD_clk  -min -1  [get_ports {pad_HRESP[0]}]
